{
    "What is LPU?": "LPU (Lovely Professional University) is a private university located in Phagwara, Punjab, India. It is one of the largest universities in India with over 30,000 students.",
    "Where is LPU located?": "LPU is located in Phagwara, Punjab, India. The campus is situated on the National Highway between Jalandhar and Ludhiana.",
    "Hospital timing kya hai?": "The University Hospital (Uni Hospital) is located in Block 34, Ground Floor. OPD hours are 8:00 AM to 8:00 PM (Monday to Saturday). Emergency services are available 24/7.",
    "Hospital में doctor ki timing kya hai?": "Dr. Amit Kumar (General Medicine) is available from 9:00 AM to 2:00 PM (Mon-Fri). Dr. Priya Sharma (General Medicine) is available from 2:00 PM to 7:00 PM (Mon-Sat).",
    "Rashmi Mittal se kab mil sakte hain?": "You can meet Mrs. Rashmi Mittal, the Pro Chancellor, on Tuesday and Friday from 4:00 PM to 6:00 PM at her office in Block 29, Room Level 1.",
    "Who is Rashmi Mittal?": "Mrs. Rashmi Mittal is the Worthy Pro Chancellor of LPU. Her interaction days are Tuesday & Friday, from 4 pm to 6 pm, in Block 29, Room Level 1.",
    "Leave apply kaise karein?": "To apply for leave: 1) Login to UMS Portal (https://ums.lpu.in), 2) Go to Student Dashboard, 3) Click 'Leave Application', 4) Fill the form with dates and reason, 5) Upload documents if needed, 6) Submit. You will receive email notification once approved.",
    "Library timing kya hai?": "The library is open from 8:00 AM to 10:00 PM on weekdays and 9:00 AM to 8:00 PM on weekends.",
    "Hostel rules kya hain?": "Key hostel rules include: Check-in time is 9:00 PM on weekdays and 10:00 PM on weekends. Visitors are not allowed in hostel rooms. Maintain cleanliness and discipline. Follow mess timings strictly.",
    "Attendance policy kya hai?": "Students must maintain minimum 75% attendance in each subject. Below 75% may result in detention. Medical leave requires doctor's certificate.",
    "Exam rules kya hain?": "Students must carry their university ID card to the exam hall. Mobile phones and electronic devices are strictly prohibited. Arrive 15 minutes before exam time.",
    "Fee payment kaise karein?": "Fee can be paid online through the UMS portal using credit/debit card, net banking, or UPI. Offline payment is also available at the university accounts office.",
    "Scholarship kaise milegi?": "LPU offers various scholarships based on academic merit, sports achievements, and financial need. Check the admissions office or UMS portal for scholarship application details.",
    "Campus map kahan milega?": "You can find the campus map on the UMS portal or ask at the information desk in the main administrative block.",
    "Mess timing kya hai?": "Mess timings are: Breakfast 7:30-9:30 AM, Lunch 12:00-2:00 PM, Snacks 4:00-5:30 PM, Dinner 7:30-9:30 PM.",
    "Wi-Fi password kya hai?": "Wi-Fi credentials are provided to students through the IT department. Contact the IT helpdesk in Block 34 for Wi-Fi access.",
    "Placement cell kahan hai?": "The Placement Cell is located in Block 34. You can contact them for internship and placement opportunities.",
    "Sports facilities kya hain?": "LPU has extensive sports facilities including cricket grounds, football fields, basketball courts, swimming pool, gymnasium, and indoor sports complex.",
    "Medical emergency mein kya karein?": "In case of medical emergency, call the university ambulance at the emergency number or visit the Uni Hospital in Block 3 . Emergency services are available 24/7.",
    "Timetable kaise check karein?": "You can check your timetable by logging into the UMS portal and navigating to the 'My Timetable' section under Student Dashboard."
}